Домашнее задание

Задание 1
Скачайте с сайта https://grouplens.org/datasets/movielens/ датасет любого размера. Определите какому фильму было выставлено больше всего оценок 5.0.

Задание 2
По данным файла power.csv посчитайте суммарное потребление стран Прибалтики (Латвия, Литва и Эстония) категорий 4, 12 и 21 за период с 2005 по 2010 года. Не учитывайте в расчетах отрицательные значения quantity.

Задание 3
Выберите страницу любого сайта с табличными данными. Импортируйте таблицы в pandas dataframe.
Примеры страниц (необязательно брать именно эти):
https://fortrader.org/quotes
https://www.finanz.ru/valyuty/v-realnom-vremeni

In [2]:
import pandas as pd

Задание 1

In [3]:
data = pd.read_csv('ratings.csv')
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25000095 entries, 0 to 25000094
Data columns (total 4 columns):
 #   Column     Dtype
---  ------     -----
 0   userId     int64
 1   movieId    int64
 2   rating     float64
 3   timestamp  int64
dtypes: float64(1), int64(3)
memory usage: 762.9 MB

In [4]:
data.head(10)

   userId  movieId  rating   timestamp
0       1      296     5.0  1147880044
1       1      306     3.5  1147868817
2       1      307     5.0  1147868828
3       1      665     5.0  1147878820
4       1      899     3.5  1147868510
5       1     1088     4.0  1147868495
6       1     1175     3.5  1147868826
7       1     1217     3.5  1147878326
8       1     1237     5.0  1147868839
9       1     1250     4.0  1147868414

In [5]:
results = data[['movieId','rating']].value_counts(normalize=True).head(10)
results.head(1)

movieId  rating
318      5.0       0.001582
dtype: float64

In [6]:
results.index[0]

(318, 5.0)

In [7]:
results.values[0]

0.0015821139879668457

In [8]:
films = pd.read_csv('movies.csv')

In [9]:
films.head()

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

In [10]:
films.query('movieId == 318').head()

     movieId                             title       genres
314      318  Shawshank Redemption, The (1994)  Crime|Drama

In [11]:
print(f'Больше всего оценок 5.0 выставлено фильму с Id 318:\n {films.loc[314]}')

Больше всего оценок 5.0 выставлено фильму с Id 318:
 movieId                                 318
title      Shawshank Redemption, The (1994)
genres                          Crime|Drama
Name: 314, dtype: object

Задание 2

In [12]:
data = pd.read_csv('power.csv')
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1189482 entries, 0 to 1189481
Data columns (total 4 columns):
 #   Column    Non-Null Count    Dtype
---  ------    --------------    -----
 0   country   1189482 non-null  object
 1   year      1189482 non-null  int64
 2   quantity  1189482 non-null  float64
 3   category  1189482 non-null  int64
dtypes: float64(1), int64(2), object(1)
memory usage: 36.3+ MB

In [13]:
data.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [14]:
data[ data['country'].str.contains('Lit', case=False) ]['country'].unique()

array(['Lithuania'], dtype=object)

In [15]:
data[ data['country'].str.contains('est', case=False) ]['country'].unique()

array(['Estonia', 'State of Palestine', 'Timor-Leste'], dtype=object)

In [16]:
data[ data['country'].str.contains('lat', case=False) ]['country'].unique()

array(['Latvia'], dtype=object)

In [23]:
filter_countries = (data['country']=='Lithuania') | (data['country']=='Estonia') | (data['country']=='Latvia')

In [24]:
filter_categories = (data['category']== 4) | (data['category']== 12) | (data['category']== 21)

In [25]:
filter_period = (data['year']>= 2005) & (data['year']<= 2010)

In [35]:
filtered_data = data [(filter_countries)&(filter_categories)&(filter_period)]
filtered_data.head()

         country  year  quantity  category
10617    Estonia  2008       1.0         4
10618    Estonia  2007       0.0         4
10619    Estonia  2006       0.0         4
10620    Estonia  2005       1.0         4
11156  Lithuania  2008       1.0         4

In [32]:
print(f"Cуммарное потребление стран Прибалтики (Латвия, Литва и Эстония)\n категорий 4, 12 и 21\n за период с 2005 по 2010 года: {filtered_data['quantity'].sum()}")

Cуммарное потребление стран Прибалтики (Латвия, Литва и Эстония)
 категорий 4, 12 и 21
 за период с 2005 по 2010 года: 240481.0

Задание 3

In [37]:
page_url = 'https://www.irn.ru/kvartiry/moskva/ceny-po-rayonam/'

In [78]:
df = pd.read_html(page_url)

In [92]:
table = df[0]

In [96]:
table.shape[1]

7

In [100]:
table.columns = range(table.shape[1])

In [101]:
table

,0,1,2,3,4,5,6
0,NaN,1,NaN,Остоженка,"Кропоткинская, Парк культуры",425 927,"-0,7%"
1,NaN,2,NaN,Центр Москвы,"Китай-город, Кузнецкий мост, Лубянка, Охотный ...",409 102,"+2,7%"
2,NaN,3,NaN,Якиманка,"Новокузнецкая, Полянка, Третьяковская",380 974,"-0,9%"
3,NaN,4,NaN,Арбат,"Александровский сад, Арбатская, Библиотека име...",379 961,"-0,9%"
4,NaN,5,NaN,Тверской,"Маяковская, Пушкинская, Тверская, Чеховская",368 244,"+1,9%"
...,...,...,...,...,...,...,...
81,NaN,82,NaN,"Вешняки, Выхино-Жулебино","Выхино, Юго-Восточная",167 172,"+1,7%"
82,NaN,83,NaN,Южное Бутово,"Бульвар адмирала Ушакова, Бунинская аллея, Ком...",167 054,"+2,9%"
83,NaN,84,1.0,"Бирюлево Восточное, Бирюлево Западное",NaN,156 480,"+3,2%"
84,NaN,85,-1.0,"Жулебино, Кожухово, Косино-Ухтомский, Некрасовка","Жулебино, Косино, Котельники, Лермонтовский пр...",154 521,"+0,7%"
85,NaN,86,NaN,"Зеленоград: Крюково, Матушкино, Савёлки, Силин...",NaN,144 830,"+1,5%"

In [117]:
new_table = table.drop(table.columns[[0,1]],axis='columns')

In [118]:
new_table

,3,4,5,6
0,Остоженка,"Кропоткинская, Парк культуры",425 927,"-0,7%"
1,Центр Москвы,"Китай-город, Кузнецкий мост, Лубянка, Охотный ...",409 102,"+2,7%"
2,Якиманка,"Новокузнецкая, Полянка, Третьяковская",380 974,"-0,9%"
3,Арбат,"Александровский сад, Арбатская, Библиотека име...",379 961,"-0,9%"
4,Тверской,"Маяковская, Пушкинская, Тверская, Чеховская",368 244,"+1,9%"
...,...,...,...,...
81,"Вешняки, Выхино-Жулебино","Выхино, Юго-Восточная",167 172,"+1,7%"
82,Южное Бутово,"Бульвар адмирала Ушакова, Бунинская аллея, Ком...",167 054,"+2,9%"
83,"Бирюлево Восточное, Бирюлево Западное",NaN,156 480,"+3,2%"
84,"Жулебино, Кожухово, Косино-Ухтомский, Некрасовка","Жулебино, Косино, Котельники, Лермонтовский пр...",154 521,"+0,7%"
85,"Зеленоград: Крюково, Матушкино, Савёлки, Силин...",NaN,144 830,"+1,5%"

In [121]:
result = new_table.rename(columns = {3:'district', 4:'metro', 5:'price_feb21', 6:'dinamics'})

In [122]:
result

,district,metro,price_feb21,dinamics
0,Остоженка,"Кропоткинская, Парк культуры",425 927,"-0,7%"
1,Центр Москвы,"Китай-город, Кузнецкий мост, Лубянка, Охотный ...",409 102,"+2,7%"
2,Якиманка,"Новокузнецкая, Полянка, Третьяковская",380 974,"-0,9%"
3,Арбат,"Александровский сад, Арбатская, Библиотека име...",379 961,"-0,9%"
4,Тверской,"Маяковская, Пушкинская, Тверская, Чеховская",368 244,"+1,9%"
...,...,...,...,...
81,"Вешняки, Выхино-Жулебино","Выхино, Юго-Восточная",167 172,"+1,7%"
82,Южное Бутово,"Бульвар адмирала Ушакова, Бунинская аллея, Ком...",167 054,"+2,9%"
83,"Бирюлево Восточное, Бирюлево Западное",NaN,156 480,"+3,2%"
84,"Жулебино, Кожухово, Косино-Ухтомский, Некрасовка","Жулебино, Косино, Котельники, Лермонтовский пр...",154 521,"+0,7%"
85,"Зеленоград: Крюково, Матушкино, Савёлки, Силин...",NaN,144 830,"+1,5%"